{
  "regions": {
    "Tanger-Tétouan-Al Hoceïma": "Située à l’extrême nord du pays, cette région mêle littoral méditerranéen, détroit de Gibraltar et montagnes du Rif. La ville de Tanger, carrefour historique entre l’Europe et l’Afrique, attire un tourisme cosmopolite. À l’est, Al Hoceima offre des plages sauvages et des falaises spectaculaires. Riche en traditions rifaines, la région est aussi un pôle émergent de pêche et d’agroalimentaire.",
    "L'Oriental": "Frontalière avec l’Algérie, l’Oriental s’articule autour de la métropole d’Oujda, centre économique et universitaire. On y trouve un terroir agricole fertile (oliviers, agrumes) et des zones minières dans l’arrière-pays. Le littoral de Nador et Driouch séduit par ses lagunes et sa gastronomie andalouse. L’Oriental est enfin un carrefour culturel, à mi-chemin entre Méditerranée et Sahara.",
    "Fès-Meknès": "Région des deux anciens empires successifs, Fès et Meknès, classés au patrimoine mondial de l’UNESCO. La médina de Fès al-Bali est un labyrinthe de monuments, d’écoles coraniques et de tanneries séculaires. Meknès, plus sobre, doit son charme à ses remparts et à ses greniers souterrains. Au nord-est, les hauteurs de l’Atlas offrent des vergers et des villages berbères pittoresques.",
    "Rabat-Sale-Kenitra": "Cœur administratif du royaume avec Rabat, capitale politique et site UNESCO. Au nord, Salé et son vieux port racontent l’histoire corsaire; à l’ouest, l’agglomération Kénitra-Kenitra est un pôle industriel et portuaire. La plaine du Gharb, riche en cultures maraîchères, irrigue la région. C’est un axe majeur Casablanca–Rabat pour le commerce et la logistique.",
    "Béni Mellal-Khénifra": "Porte sud du Moyen Atlas, la région s’étend de la grande plaine du Tadla aux massifs forestiers. Béni Mellal, au pied du mont Ziat, est réputée pour ses vergers et ses stations thermales. Khénifra et Azilal, plus en altitude, offrent campagnes et gorges sauvages. L’économie locale allie agriculture irriguée, artisanat berbère et tourisme rural.",
    "Casablanca-Settat": "Centre économique du pays, dominé par Casablanca, plus grande métropole et poumon industriel. Le port de Casa-Port est l’un des plus actifs d’Afrique, desservant l’industrie, le textile, l’automobile. Settat et Berrechid constituent l’arrière-pays agricole et périurbain. À l’ouest, la façade atlantique propose stations balnéaires et centres de recherche.",
    "Marrakech-Safi": "Région de la “Perle du Sud” : Marrakech, destination touristique mondiale pour sa médina, ses palais et ses souks. Au sud, la province de Safi est célèbre pour sa céramique et ses centres de poterie. Le haut Atlas abrite villages puis gorges du Dadès et du Todra. L’économie combine tourisme, agriculture d’arganier et artisanat.",
    "Drâa-Tafilalet": "Aux portes du Sahara, cette région suit la vallée du Drâa, jalonnée d’oasis et de kasbahs. Errachidia est un point de départ vers les dunes de Merzouga. Le plateau phosphatier de Khouribga alimente l’industrie nationale. La richesse patrimoniale (villes fortifiées, musique gnawa) attire un tourisme d’aventure.",
    "Souss-Massa": "Domaine d’Agadir, station balnéaire majeure avec son climat doux et ses plages d’Anza et Taghazout, mondialement prisées du surf. À l’arrière-pays, l’arganeraie couvre des collines semi-arides. Les plaines du Souss produisent agrumes, tomates et avocats pour l’export. Le parc national de Massa protège ibis chauves et faucons pèlerins.",
    "Guelmim-Oued Noun": "“Porte du désert” : Guelmim est la dernière grande ville avant les dunes, connue pour ses marchés nomades. Les tribus sahariennes s’y rassemblent chaque année pour leur festival. Le littoral, plus bas, comprend Tan-Tan et Sidi Ifni, héritiers de l’architecture espagnole. Économie mixte de pêche, élevage et artisanat du cuir.",
    "Laâyoune-Sakia El Hamra": "Région du Sahara occidental administrée par le Maroc, centrée sur Laâyoune, ville portuaire et minière. Phosphate, pêche et services y dominent. Les dunes, jusqu’à Es-Semara, sont gibiers d’oiseaux migrateurs et de faune saharienne.",
    "Dakhla-Oued Ed-Dahab": "Presqu’île battue par l’Atlantique, Dakhla est un paradis du kitesurf et de l’ostréiculture. La lagune abrite flamants, huîtres sauvages et phoques moines. Le trajet vers Aousserd traverse plateaux rocheux et palmeraies. Économie centrée sur le tourisme nautique, la pêche et l’éco-tourisme désertique."
  },
  "provinces": {
    "Tanger-Assilah": "Cette province côtière comprend les villes de Tanger, port mondialement connu, et d’Asilah, charmante médina blanche aux remparts peints de fresques. Son panorama s’étend du détroit de Gibraltar aux plages de sable doré. Asilah accueille chaque été un festival d’art international. L’économie repose sur la pêche, le tourisme culturel et un port en pleine expansion.",
    "Mdiq-Fnidq": "Bordée par la baie de M’diq, cette province est un pôle résidentiel et balnéaire très prisé des Marocains. Fnideq, à la frontière algérienne, est un grand marché frontalier. Les criques rocheuses de Punta Blanca attirent plongeurs et amateurs de sports nautiques. Agriculture maraîchère et petits commerces complètent l’économie locale.",
    "Tetouan": "Ancienne capitale du Protectorat espagnol, Tétouan arbore une médina andalouse inscrite à l’UNESCO. Ses ruelles étroites et ses palais renvoient à un riche passé hispanique. À flanc de montagnes, le site offre un panorama sur la mer et la vallée. L’artisanat (cuir, céramique) est vivace, et la région bénéficie d’un important flux touristique.",
    "Fahs-Anjra": "Ancienne zone rurale, Fayhs-Anjra se transforme en pôle logistique grâce à la proximité de Tanger. Ses plaines fertiles produisent fruits et légumes pour la région. Quelques villages de montagne conservent un mode de vie traditionnel. La nouvelle “Tanger Free Zone” renforce l’industrialisation et la création d’emplois.",
    "Larache": "Située à l’embouchure de l’oued Loukkos, Larache est réputée pour ses marais salants et sa lagune ornithologique. La cité, fondée par les Portugais, garde des fortifications historiques. À l’ouest, les plages de Lixus offrent vestiges antiques et baignades. L’industrie agroalimentaire et la pêche animent l’économie locale.",
    "Al-Hoceima": "Au cœur du Rif, cette province allie stations balnéaires et villages berbères accrochés aux falaises. Sa plage aménagée et son musée national du folklore attirent les estivants. L’arrière-pays, boisé, offre des sentiers de randonnée. Les produits de la mer et l’artisanat rifain restent des piliers économiques.",
    "Chefchaouen": "La « ville bleue » du Rif, célèbre pour ses ruelles ocre-bleu et ses montagnes verdoyantes. Chefchaouen est un centre de l’artisanat textile et du tourisme culturel. Ses remparts sextoncentistes dominent la plaza Uta el-Hammam. Les élevages caprins et l’huile d’argan y sont également développés.",
    "Ouezzane": "Description de la province Ouezzane.",
    "Oujda-Angad": "Description de la province Oujda-Angad.",
    "Nador": "Description de la province Nador.",
    "Driouch": "Description de la province Driouch.",
    "Jerada": "Description de la province Jerada.",
    "Berkane": "Description de la province Berkane.",
    "Taourirt": "Description de la province Taourirt.",
    "Guercif": "Description de la province Guercif.",
    "Figuig": "Description de la province Figuig.",
    "Fes": "Description de la province Fes.",
    "Meknes": "Description de la province Meknes.",
    "El-Hajeb": "Description de la province El-Hajeb.",
    "Ifrane": "Description de la province Ifrane.",
    "Moulay-Yacoub": "Description de la province Moulay-Yacoub.",
    "Sefrou": "Description de la province Sefrou.",
    "Boulemane": "Description de la province Boulemane.",
    "Taounate": "Description de la province Taounate.",
    "Taza": "Description de la province Taza.",
    "Rabat": "Description de la province Rabat.",
    "Sale": "Description de la province Sale.",
    "Skhirate--Temara": "Description de la province Skhirate--Temara.",
    "Kenitra": "Description de la province Kenitra.",
    "Khemisset": "Description de la province Khemisset.",
    "Sidi-Kacem": "Description de la province Sidi-Kacem.",
    "Sidi-Slimane": "Description de la province Sidi-Slimane.",
    "Casablanca": "Description de la province Casablanca.",
    "Mohammadia": "Description de la province Mohammadia.",
    "El-Jadida": "Description de la province El-Jadida.",
    "Nouaceur": "Description de la province Nouaceur.",
    "Mediouna": "Description de la province Mediouna.",
    "Benslimane": "Description de la province Benslimane.",
    "Berrechid": "Description de la province Berrechid.",
    "Settat": "Description de la province Settat.",
    "Sidi-Bennour": "Description de la province Sidi-Bennour.",
    "Marrakech": "Description de la province Marrakech.",
    "Chichaoua": "Description de la province Chichaoua.",
    "Al-Haouz": "Description de la province Al-Haouz.",
    "El-Kelâa-des--Sraghna": "Description de la province El-Kelâa-des--Sraghna.",
    "Essaouira": "Description de la province Essaouira.",
    "Rehamna": "Description de la province Rehamna.",
    "Safi": "Description de la province Safi.",
    "Youssoufia": "Description de la province Youssoufia.",
    "Errachidia": "Description de la province Errachidia.",
    "Ouarzazate": "Description de la province Ouarzazate.",
    "Midelt": "Description de la province Midelt.",
    "Tinghir": "Description de la province Tinghir.",
    "Zagora": "Description de la province Zagora.",
    "Agadir-Ida-Ou-Tanane": "Description de la province Agadir-Ida-Ou-Tanane.",
    "Inezgane--Ait-Melloul": "Description de la province Inezgane--Ait-Melloul.",
    "Chtouka--Ait-Baha": "Description de la province Chtouka--Ait-Baha.",
    "Taroudannt": "Description de la province Taroudannt.",
    "Tiznit": "Description de la province Tiznit.",
    "Tata": "Description de la province Tata.",
    "Guelmim": "Description de la province Guelmim.",
    "Assa-Zag": "Description de la province Assa-Zag.",
    "Tan-Tan": "Description de la province Tan-Tan.",
    "Sidi-Ifni": "Description de la province Sidi-Ifni.",
    "Laayoune": "Description de la province Laayoune.",
    "Boujdour": "Description de la province Boujdour.",
    "Tarfaya": "Description de la province Tarfaya.",
    "Es-Semara": "Description de la province Es-Semara.",
    "Oued-Ed-Dahab": "Description de la province Oued-Ed-Dahab.",
    "Aousserd": "Description de la province Aousserd.",
    "Beni-Mellal": "Description de la province Beni-Mellal.",
    "Azilal": "Description de la province Azilal.",
    "Fquih-Ben-Salah": "Description de la province Fquih-Ben-Salah.",
    "Khenifra": "Description de la province Khenifra.",
    "Khouribga": "Description de la province Khouribga.",
    "Tanger-Tetouan-Al-Hoceima": "Description de la province Tanger-Tetouan-Al-Hoceima."
  }
}